# 실제 데이터 분석

import numpy as np
import pandas as pd

data = {
    "이름": ["민수", "지수", "철수", "영희", "수진", "현우", "유진", "준호"],
    "공부시간": [2, 5, 4, 1, 6, 3, 5, 2],
    "출석률": [80, 95, 90, 70, 100, 85, 95, 75],
    "과제점수": [70, 90, 85, 60, 95, 80, 88, 65],
    "시험점수": [65, 92, 87, 55, 98, 78, 90, 60]
}

df = pd.DataFrame(data)

print(df)

# 공부시간 평균 출력
print(df["공부시간"].mean())

# 공부시간이 4시간 이상인 학생의 이름과 시험점수 출력
print(df[df["공부시간"] >= 4][["이름", "시험점수"]])

# 다음 조건을 모두 만족하는 학생 찾기 
# -> 출석률 >= 90, 과제점수 >= 85, 시험점수 >= 80 & 이름 + 시험점수만 출력
print(df[(df["출석률"] >= 90) & df(["과제점수"] >= 85) & (df["시험점수"] >= 85)][["이름", "시험점수"]])

# "시험점수"를 NumPy 배열로 만들기
exam_array = np.array(df["시험점수"])

# 시험점수 평균, 최고점수, 최저점수
print(exam_array.mean())
print(exam_array.max())
print(exam_array.min())

# 시험점수가 80점 이상이면 "합격", 아니면 "불합격"인 새로운 컬럼 "결과" 만들기
df["결과"] = df["시험점수"].apply(
    lambda x: "합격" if x >= 80 else "불합격"
)

# 모델의 입력값과 정답 나누기
# 시험점수를 예측한다고 가정할 때
# 입력값 -> 공부시간, 출석률, 과제점수 / 정답 -> 시험점수
x = df[["공부시간", "출석률", "과제점수"]]
y = df["시험점수"]
print(x)
print(y)