# 1. AND - &
# 조건을 모두 만족해야 할 때
df[(조건1) & (조건2)]

# 나이가 20살이고 AND 점수가 80점 이상
result = df[(df["나이"] == 20) & (df["점수"] >= 80)]
print(result)

# 2. OR - |
# 조건 중 하나라도 만족하면 됨
df[(조건1)| (조건2)]

# 나이가 20살이거나 OR 점수가 90점 이상
result = df[(df["나이"] == 20) | (df["점수"] >= 90)]
print(result)

# 3. AND + OR 같이 사용
# 예를 들어 나이가 20살이고 점수가 80점 이상 또는 나이가 22살인 사람
result = df[
    ((df["나이"] == 20) & (df["점수"] >= 80))
    | (df["나이"] == 22)
]
print(result)

# 4. NOT - ~
# 조건의 반대를 가져올 때
df[~(조건)]

# 예를 들어 80점 이상이 아닌 사람
result = df[~(df["점수"] >= 80)]
print(result)

'df["점수"] >= 80'의 반대가 '~(df["점수"] >= 80)'

# 5. 범위 조건
# 점수가 70 이상이고 90 이하
result = df[
    (df["점수"] >= 70) &
    (df["점수"] <= 90)
]
print(result)

# Python에서 아래 코드처럼 쓰는 것과 달리 Pandas에서는 조건을 나눠서 &로 연결하는게 기본
70 <= score <= 90

# 6. 특정 값 여러개 찾기 - isin()
# 이 값들 중 하나에 포함되어 있나를 확인하는 것
# 나이가 20살 또는 22살인 사람
result = df[df["나이"].isin([20, 22])]
print(result)

# 7. 문자열 조건도 가능
# 예를 들어 이름이 "민수"인 사람
df[df["이름"] == "민수"]

# 문자열에 특정 글자가 포함됐는지 -> 그러면 "수"가 들어간 이름 찾음
df[df["이름"].str.contains("수")]
